--- a/docs/input-data/crac/creation-context.md
+++ b/docs/input-data/crac/creation-context.md
@@ -15,20 +15,21 @@ Many implementations of CracCreationContext exist, depending on the original for
 specific API. CracCreationContext can be obtained with the `readWithContext` methods, but you have to 
 explicitly cast it to its implementation, if you desire to access its class' specific methods.
 
-~~~{plantuml}
-@startuml
-CracCreationContext <|-- UcteCracCreationContext
-JsonCracCreationContext --|> CracCreationContext
-CimCracCreationContext --|> CracCreationContext
-NcCreationContext --|> CracCreationContext
-interface UcteCracCreationContext {
-}
-interface CracCreationContext {
-}
-UcteCracCreationContext <|-- FbConstraintCreationContext
-UcteCracCreationContext <|-- CseCracCreationContext
-@enduml
-~~~
+```{mermaid}
+classDiagram
+    CracCreationContext <|-- UcteCracCreationContext
+    CracCreationContext <|-- JsonCracCreationContext
+    CracCreationContext <|-- CimCracCreationContext
+    CracCreationContext <|-- NcCreationContext
+    class UcteCracCreationContext {
+        <<interface>>
+    }
+    class CracCreationContext {
+        <<interface>>
+    }
+    UcteCracCreationContext <|-- FbConstraintCreationContext
+    UcteCracCreationContext <|-- CseCracCreationContext
+```
 
 ```java
 CracCreationContext cracCreationContext = readWithContext(filename, inputStream, network, offsetDateTime, cracCreationParameters);
